"""
46. Создать информационную систему позволяющую работать с сотрудниками некой компании \ студентами вуза \ учениками школы

Примерная функциональность для реализации:

получить список всех людей 
CRUD (create-read-update-delete) для определенного человека в БД
импортировать / экспортировать людей в БД
_______________________________________________________________________________________________________
* create-read-update-delete (создание - чтение - обновление существующей записи - удалить из базы)
* всего 7 функций
* id, ф, и, о, тел - 1 строка записи
* create() словарь
* read() id
* delete() id
* update 
"""