"""
17. Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
Найдите произведение элементов на указанных позициях. 
Позиций может быть более двух, пользователь вводит индексы с клавиатуры
"""

# здесь я совсем завис, буду позже разбираться

# import random

# k = [random.randint(-10,10) for s in range(10)]
# print('current list: ', k)

# for
# mult += k[i]


    

   