"""
43. Задача:

предложить улучшения кода для уже решённых задач (максимально использовать lambda, filter, map, zip, enumerate, list comprehension):

а) берём задание 38 с семинара 5 про конфеты
б) берём задание 34 с семинара 4 про кубы чисел
С помощью использования lambda, filter, map, zip, enumerate, list comprehension

"""
 
# доработал игру про конфеты (все что нужно было в задании после 5 семинара, файл les5__task4_v2.py)

# улучшения кода c задания 34 с семинара 4 про кубы чисел в файле les4__task8_v2.py